Revit 2024 API
ExportFontTable Class
 A table supporting a mapping of Revit font names to font names that will be set in the target export format.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class ExportFontTable : IEnumerable<KeyValuePair<ExportFontKey, ExportFontInfo>>,
	IDisposable
Visual Basic
Public Class ExportFontTable _
	Implements IEnumerable(Of KeyValuePair(Of ExportFontKey, ExportFontInfo)),  _
	IDisposable
Visual C++
public ref class ExportFontTable : IEnumerable<KeyValuePair<ExportFontKey^, ExportFontInfo^>>,
	IDisposable
Remarks
This table is structured as a mapping from ExportFontKey to ExportFontInfo members. The ExportFontKey contains the identification information for the font table: the Revit font name. The ExportFontInfo contains the font name to use in the export format.
The table can be accessed via direct iteration as a collection of KeyValuePairs, or by traversal of the stored keys obtained from GetKeys(), or via specific lookup of a key constructed externally. In all cases, the ExportFontInfo returned will be a copy of the ExportFontInfo from the table. In order to make changes to the ExportFontInfo and use those settings during export, set the modified ExportFontInfo back into the table using the same key.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExportFontTable
See Also
ExportFontTable Members
Autodesk.Revit.DB Namespace